[{"title":"Kubernetes Without the Kubernetes: Local Dev with vind","description":"What if you could run a complete, production-compatible Kubernetes cluster without any Kubernetes? vind (vCluster in Docker) creates fully functional Kubernetes environments using only Docker containers—no host cluster, no kind, no minikube. This talk explores how vind reimagines local Kubernetes development with zero image management via pull-through registry proxy, working LoadBalancers reachable from localhost, multi-node simulation, and external node joining via VPN for hybrid testing.","date":"2026-02-16","conference":"Cloud Native Frankfurt Meetup Feb 2026","tags":["Kubernetes","Docker","vCluster","vind","Local Development"],"recordingUrl":null,"conferenceUrl":"https://community.cncf.io/events/details/cncf-cloud-native-frankfurt-presents-cloud-native-frankfurt-meetup-feb-2026/","slidesUrl":null,"workshopUrl":null,"type":"talk","status":"accepted","upcoming":true},
{"title":"Instant KAI Sandboxes with vCluster: Multi-Tenant, Multi-Scheduler GPU Sharing","description":"Learn how to create instant Kubernetes AI (KAI) sandboxes using vCluster, enabling multi-tenant environments with efficient GPU sharing across multiple schedulers. This talk explores practical patterns for providing isolated AI/ML development environments while maximizing GPU utilization through advanced scheduling techniques.","date":"2026-07-09","conference":"WeAreDevelopers World Congress 2026","tags":["Platform Engineering","Kubernetes","vCluster","Artificial Intelligence","GPU"],"recordingUrl":null,"conferenceUrl":"https://www.wearedevelopers.com/world-congress","slidesUrl":null,"workshopUrl":null,"type":"talk","status":"accepted","upcoming":true},
{"title":"Flexible Kubernetes Multitenancy with vCluster","description":"In this session, we'll explore how to implement flexible multitenancy in Kubernetes using vCluster. You'll learn how to design platforms that can adapt to different isolation requirements, resource sharing needs, and trust models within a single cluster. We'll explore: Multitenancy Spectrum - Understanding the three dimensions of multitenancy (isolation levels, resource sharing, trust boundaries); Flexibility in Practice - How to mix and match different multitenancy models for different teams and workloads; vCluster Deep Dive - How virtual clusters enable this flexibility while maintaining strong isolation boundaries; Real-World Scenarios - Live demo showing how to implement different multitenancy patterns based on actual use cases.","date":"2026-05-20","conference":"DevOpsPro Europe 2026","tags":["Platform Engineering","Kubernetes","vCluster","DevOps"],"recordingUrl":null,"conferenceUrl":"https://devopspro.eu/","slidesUrl":null,"workshopUrl":null,"type":"talk","status":"accepted","upcoming":true},
{"title":"Workshop: TBD","description":"Platform Engineering Day is dedicated to exploring real-world challenges and advanced practices behind building and scaling Internal Developer Platforms (IDPs). IDPs provide curated capabilities, frameworks, and developer-centric experiences to accelerate internal teams such as application developers.","date":"2026-03-23","conference":"Platform Engineering Day @ KubeCon EU Amsterdam 2026","tags":["Platform Engineering","Kubernetes","Workshop"],"recordingUrl":null,"conferenceUrl":"https://events.linuxfoundation.org/kubecon-cloudnativecon-europe/co-located-events/platform-engineering-day/","slidesUrl":null,"workshopUrl":null,"type":"workshop","status":"accepted","upcoming":true},
{"title":"Flexible Kubernetes Multitenancy with vCluster","description":"In this session, we'll explore how to implement flexible multitenancy in Kubernetes using vCluster. You'll learn how to design platforms that can adapt to different isolation requirements, resource sharing needs, and trust models within a single cluster. We'll explore: - Multitenancy Spectrum: Understanding the three dimensions of multitenancy - isolation levels (physical/logical/none), resource sharing (dedicated/pooled/shared), and trust boundaries (zero/partial/full) - Flexibility in Practice: How to mix and match different multitenancy models for different teams and workloads - vCluster Deep Dive: How virtual clusters enable this flexibility while maintaining strong isolation boundaries - Real-World Scenarios: Live demo showing how to implement different multitenancy patterns based on actual use cases","date":"2025-12-01","conference":"SHIPPED25","tags":["Platform Engineering","Kubernetes","vCluster"],"recordingUrl":"https://youtu.be/5NFENlnH-WM?list=TLGG3ARVTHb9ansxMDEyMjAyNQ","conferenceUrl":"https://octopus.com/shipped","slidesUrl":"https://github.com/Piotr1215/youtube/blob/main/vcluster-multitenancy/presentation.md","workshopUrl":null,"type":"talk","status":"completed","upcoming":false},
{"title":"GPU Sharing at Scale: vCluster + NVIDIA KAI Scheduler","description":"Kubernetes offers many ways to share GPUs, but a single, cluster-wide scheduler often forces trade-offs between utilization, stability, and team autonomy. This talk shows how vCluster makes the NVIDIA Kubernetes AI Scheduler (KAI) run as an opt-in service for each tenant—so platform teams can raise GPU density while keeping operations predictable. What We'll Cover: Problem statement – why mixed workloads leave GPUs under-used and complicate on-call; vCluster fundamentals – lightweight control planes that isolate scheduling logic, not hardware; KAI at a glance – fractional GPU allocation, gang queues, topology awareness; Live demonstration – two vClusters on one host. Key Takeaways: A reproducible pattern for running different schedulers side-by-side; Practical steps to increase GPU utilisation without adding more clusters; An isolation model that lets teams experiment safely. Why It Matters: As GPU demand grows, platform engineers must balance cost efficiency with reliability. Combining vCluster and KAI delivers both—turning idle accelerators into productive capacity while preserving operational control.","date":"2025-11-01","conference":"SREDay Paris Q4 2025","tags":["Platform Engineering","Kubernetes","vCluster","GPU","SRE"],"recordingUrl":"https://www.youtube.com/watch?v=JpdYrwi-33M","conferenceUrl":"https://sreday.com/2025-paris-q4/","slidesUrl":null,"workshopUrl":null,"type":"talk","status":"completed","upcoming":false},
{"title":"Workshop: Introduction to vCluster: Building Internal Developer Platforms","description":"The workshop introduces participants to vCluster, demonstrating how to create and manage virtual Kubernetes environments for multiple development teams. Attendees will learn to use vCluster effectively, starting with basic setups and progressing to more advanced configurations. Throughout the workshop, participants will take on the perspective of a platform engineering team, making decisions and implementing solutions to serve the needs of various development groups within an organization. Key Focus Areas: Introduction to vCluster and virtual Kubernetes clusters; Setting up and configuring virtual Kubernetes clusters; Managing multiple development environments; Implementing shared services and optimizing resources; Enhancing developer workflows with self-service provisioning. Participants will: Set up and configure virtual Kubernetes clusters; Learn to manage multiple team environments efficiently; Explore resource optimization and cost reduction strategies; Implement progressive improvements to virtual cluster setups; Understand vCluster's role in enhancing developer productivity.","date":"2025-10-01","conference":"Kubernetes Community Days UK - Edinburgh 2025","tags":["Platform Engineering","Kubernetes","vCluster"],"recordingUrl":null,"conferenceUrl":"https://community.cncf.io/events/details/cncf-kcd-uk-presents-kubernetes-community-days-uk-edinburgh-2025/","slidesUrl":null,"workshopUrl":"https://killercoda.com/decoder/course/vcluster/vcluster_introduction","type":"workshop","status":"completed","upcoming":false},
{"title":"Instant KAI Sandboxes with vCluster: Multi-Tenant, Multi-Scheduler GPU Sharing","description":"Learn how to create instant Kubernetes AI (KAI) sandboxes using vCluster, enabling multi-tenant environments with efficient GPU sharing across multiple schedulers. This talk explores practical patterns for providing isolated AI/ML development environments while maximizing GPU utilization through advanced scheduling techniques.","date":"2025-10-01","conference":"Conf42 Kube Native 2025","tags":["Platform Engineering","Kubernetes","vCluster","Artificial Intelligence","GPU"],"recordingUrl":null,"conferenceUrl":"https://www.conf42.com/kubenative2025","slidesUrl":null,"workshopUrl":null,"type":"talk","status":"completed","upcoming":false},
{"title":"Keynote: Flexible Kubernetes Multitenancy with vCluster","description":"In this session, we'll explore how to implement flexible multitenancy in Kubernetes using vCluster. You'll learn how to design platforms that can adapt to different isolation requirements, resource sharing needs, and trust models within a single cluster. We'll explore: Multitenancy Spectrum - Understanding the three dimensions of multitenancy (isolation levels, resource sharing, trust boundaries); Flexibility in Practice - How to mix and match different multitenancy models for different teams and workloads; vCluster Deep Dive - How virtual clusters enable this flexibility while maintaining strong isolation boundaries; Real-World Scenarios - Live demo showing how to implement different multitenancy patterns based on actual use cases.","date":"2025-09-01","conference":"SREday London Q3 2025","tags":["Platform Engineering","Kubernetes","vCluster","SRE"],"recordingUrl":"https://www.youtube.com/watch?v=sfGyBZmNxqk","conferenceUrl":"https://sreday.com/2025-london-q3/","slidesUrl":"https://github.com/Piotr1215/youtube/blob/main/vcluster-multitenancy/presentation.md","workshopUrl":null,"type":"keynote","status":"completed","upcoming":false},
{"title":"How to build cloud native platforms with Kubernetes","description":"Building cloud native developer platforms using vcluster for team isolation while sharing common resources. The talk covers creating self-service portals, leveraging APIs, and automating workflows to enhance productivity and reliability. Interactive demo showcasing how to set up and manage virtual clusters for development teams.","date":"2025-06-01","conference":"Cloud Native Frankfurt Meetup Jun 2025","tags":["Platform Engineering","Kubernetes","vCluster"],"recordingUrl":null,"conferenceUrl":"https://community.cncf.io/events/details/cncf-cloud-native-frankfurt-presents-cloud-native-frankfurt-meetup-jun-2025/","slidesUrl":null,"workshopUrl":null,"type":"talk","status":"completed","upcoming":false},
{"title":"How to Build Cloud Native Platforms with Kubernetes","description":"In this talk, I will explore how to build cloud-native platforms using Kubernetes. I will discuss creating self-service portals, leveraging programmatic APIs, and automating workflows to enhance productivity and reliability.","date":"2025-03-01","conference":"SREday London Q1 2025","tags":["Platform Engineering","Kubernetes","SRE"],"recordingUrl":"https://www.youtube.com/watch?v=O1BH5Y2bAdQ","conferenceUrl":"https://sreday.com/2025-london-q1/","slidesUrl":null,"workshopUrl":null,"type":"talk","status":"completed","upcoming":false},
{"title":"How to Build a Kubernetes Platform with vCluster","description":"In this hands-on workshop, you will learn how to create and maintain well-architected Kubernetes platforms. We will start with creating virtual clusters for every team and work our way to installing other components on top of them to create a platform. Platform Engineering focuses on empowering developers and organizations by creating and maintaining internal software products known as platforms. You will learn how to balance the isolation between teams with sharing and utilizing common resources. This content is valuable for Platform Engineers, Architects, DevOps Specialists, or anyone curious about how platforms can drive innovation and efficiency in development.","date":"2025-03","conference":"vCluster Webinar Series: Multi-tenancy March","tags":["Platform Engineering","Kubernetes","vCluster"],"recordingUrl":"https://www.youtube.com/watch?v=fQaPml9NJiY","conferenceUrl":null,"slidesUrl":null,"workshopUrl":"https://github.com/LoftLabs-Experiments/workshop-cloud-native-platform","type":"workshop","status":"completed","upcoming":false},
{"title":"Building Multitenant Developer Platforms With vCluster","description":"Platform Engineering focuses on empowering developers and organizations by creating and maintaining internal software products known as platforms. In this talk, we will explore how to create multi-tenant, well-architected infrastructure platforms using vCluster.","date":"2025-01-01","conference":"Cloud Native Summit Munich","tags":["Platform Engineering","Kubernetes","vCluster"],"recordingUrl":null,"conferenceUrl":"https://cloudnativesummit.de/","slidesUrl":null,"workshopUrl":null,"type":"talk","status":"completed","upcoming":false},
{"title":"How to build cloud native platforms with Kubernetes","description":"Platform Engineering focuses on empowering developers and organizations by creating and maintaining internal software products known as platforms. In this talk, we will explore what platforms are, why they are important, and uncover best practices for creating and maintaining well-architected platforms.","date":"2024-12","conference":"Azure Developer Community Day 2024 München","tags":["Platform Engineering","Kubernetes"],"recordingUrl":"N/A","conferenceUrl":"https://muc24.azuredev.org/","slidesUrl":null,"workshopUrl":null,"type":"talk","status":"completed","upcoming":false},
{"title":"From Prompts to Automation: GPTScript and Fabric","description":"Unlock the power of GPTScript—turn your prompts into full-fledged automation! From running CLI commands to managing APIs, GPTScript lets you control your workflows using plain language. Join my talk to see how this game-changing tool makes complex tasks effortless.","date":"2024-11-01","conference":"Conf42 Prompt Engineering 2024","tags":["Artificial Intelligence","CLI"],"recordingUrl":"https://youtu.be/_52VVf9ZBMA","conferenceUrl":"https://www.conf42.com/prompt2024","slidesUrl":null,"workshopUrl":null,"type":"talk","status":"completed","upcoming":false},
{"title":"How to build cloud native platforms with Kubernetes","description":"Platform Engineering focuses on empowering developers and organizations by creating and maintaining internal software products known as platforms. In this talk, we will explore what platforms are, why they are important, and uncover best practices for creating and maintaining well-architected platforms.","date":"2024-11","conference":"SHIPPED24","tags":["Platform Engineering","Kubernetes"],"recordingUrl":"https://youtu.be/1WfJEDsQ4YI?list=PLAGskdGvlaw1ykkyds5NXYdYCeF798C7l","conferenceUrl":"https://octopus.com/shipped","slidesUrl":null,"workshopUrl":null,"type":"talk","status":"completed","upcoming":false},
{"title":"The Architecture of Developer Platforms","description":"Internal Developer Platforms become more and more popular. There are many kinds of platforms; software focused, security, cost management and infrastructure. This talk focuses on best practices of architecting infrastructure focused developer platforms. The talk covers: what is an infrastructure focused developer platform, how to measure its success, how to avoid common design mistakes, what are emerging architectural patterns for designing those platforms, what tools can help in the design process, and how to use an internal platform. I work on a day-to-day basis with designing, testing and maintaining infrastructure platforms.","date":"2024-03-01","conference":"Worldwide Software Architecture Summit 2024 – Career Track","tags":["Platform Engineering","Architecture"],"recordingUrl":"https://youtu.be/D2EjyyA5gZQ?t=15411","conferenceUrl":null,"slidesUrl":null,"workshopUrl":null,"type":"talk","status":"completed","upcoming":false},
{"title":"Introduction to vCluster: Building Internal Developer Platforms","description":"The workshop introduces participants to vCluster, demonstrating how to create and manage virtual Kubernetes environments for multiple development teams. Attendees will learn to use vCluster effectively, starting with basic setups and progressing to more advanced configurations. Throughout the workshop, participants will take on the perspective of a platform engineering team, making decisions and implementing solutions to serve the needs of various development groups within an organization.","date":"2024-03-01","conference":"Kubernetes Community Days UK - London 2024","tags":["Platform Engineering","Kubernetes"],"recordingUrl":null,"conferenceUrl":"https://community.cncf.io/events/details/cncf-kcd-uk-presents-kubernetes-community-days-uk-london-2024/","slidesUrl":null,"workshopUrl":"https://killercoda.com/decoder/course/vcluster/vcluster_introduction","type":"workshop","status":"completed","upcoming":false},
{"title":"How to Build Cloud-Native Platforms with Kubernetes","description":"Platform Engineering and SRE focus on empowering developers and organizations by creating and maintaining internal software products known as platforms. In this blog, we will explore what platforms are, why they are important, and uncover best practices for well-architected platforms.","date":"2024-02-01","conference":"Conf42 Platform Engineering 2024","tags":["Platform Engineering","Kubernetes"],"recordingUrl":"https://www.youtube.com/watch?v=HQNeAZUXzbk","conferenceUrl":"https://www.conf42.com/Platform_Engineering_2024_Piotr_Zaniewski_cloudnative_kubernetes_platforms","slidesUrl":null,"workshopUrl":null,"type":"talk","status":"completed","upcoming":false},
{"title":"How to Learn Cloud Native Technologies Using AI","description":"Are you struggling to learn Kubernetes or other CNCF technologies? You're not alone! Kubernetes can be complex, but with the power of AI, mastering it becomes much easier. In this video, we'll show you how AI tools, like Flowise, can help you understand Kubernetes faster and more effectively.","date":"2024-02","conference":"Localhost Conference 2024","tags":["Artificial Intelligence","Kubernetes"],"recordingUrl":"https://youtu.be/_L48jgOHKN4?t=10885","conferenceUrl":"https://sessionize.com/localhost-conference-2024/","slidesUrl":null,"workshopUrl":null,"type":"talk","status":"completed","upcoming":false},
{"title":"Kubernetes Certifications: How to Take Your Career to Next Level","description":"Some say that Kubernetes is a fabric for cloud native applications, platform to build platforms or operating system of the cloud. Well, all of those statements are true, but most importantly, Kubernetes is everywhere and its popularity will only grow, as it fades to the background powering workloads on servers in public, private and hybrid clouds, on edge and even in space. Big part of DevOps movement is 'learning culture'. Companies expect more from new and seasoned employees, technologies come and go with neck breaking speed. One proven way of continuously learning is investing in yourself by learning and validating your knowledge with a certificate. CNCF created 3 Kubernetes certifications, one for administrators: CKA, for developers: CKAD and security specialists: CKS. During this talk we will look into learning process, certification details and I will share with you tips and tricks on how to pass the exams.","date":"2023-11","conference":"DevOps Meetup","tags":["Kubernetes","Career Development"],"recordingUrl":"https://youtu.be/xn1O6L3yqf0?t=2507","conferenceUrl":null,"slidesUrl":null,"workshopUrl":null,"type":"talk","status":"completed","upcoming":false},
{"title":"How to create and maintain good software documentation","description":"Let's define desired characteristics of software documentation to fit into modern, rapid pace of development. Documentation should be Simple to decrease maintenance effort and make sure all stakeholders can understand the core concepts. Holistic to account for different types of documentation consumers requiring different contexts. Automated to ensure maintenance over time with minimal impact on development teams. Reusable across software projects with a structured but flexible documentation model. Portable to generate and distribute documentation independently on any hosting medium.","date":"2021-11","conference":"Worldwide Software Architecture Summit 2021 (WSAS) - Geekle","tags":["Documentation"],"recordingUrl":"https://youtu.be/-YmLFMDUzv0","conferenceUrl":null,"slidesUrl":null,"workshopUrl":null,"type":"talk","status":"completed","upcoming":false},
{"title":"Flexible Kubernetes Multitenancy with vCluster","description":null,"date":null,"conference":"PlatformCon 2026","tags":["Platform Engineering","Kubernetes","vCluster"],"recordingUrl":null,"conferenceUrl":null,"slidesUrl":null,"workshopUrl":null,"type":"talk","status":"submitted","upcoming":false},
{"title":"Workshop: Introduction to vCluster: Building Internal Developer Platforms","description":null,"date":null,"conference":"PlatformCon 2026","tags":["Platform Engineering","Kubernetes","vCluster"],"recordingUrl":null,"conferenceUrl":null,"slidesUrl":null,"workshopUrl":null,"type":"workshop","status":"submitted","upcoming":false},
{"title":"Flexible Kubernetes Multitenancy with vCluster","description":null,"date":null,"conference":"DevSum 2026","tags":["Platform Engineering","Kubernetes","vCluster"],"recordingUrl":null,"conferenceUrl":null,"slidesUrl":null,"workshopUrl":null,"type":"talk","status":"submitted","upcoming":false},
{"title":"Flexible Kubernetes Multitenancy with vCluster","description":null,"date":null,"conference":"Cloud Native Days Austria 2026","tags":["Platform Engineering","Kubernetes","vCluster"],"recordingUrl":null,"conferenceUrl":null,"slidesUrl":null,"workshopUrl":null,"type":"talk","status":"submitted","upcoming":false},
{"title":"Flexible Kubernetes Multitenancy with vCluster","description":null,"date":null,"conference":"ContainerDays Hamburg 2026","tags":["Platform Engineering","Kubernetes","vCluster"],"recordingUrl":null,"conferenceUrl":null,"slidesUrl":null,"workshopUrl":null,"type":"talk","status":"submitted","upcoming":false},
{"title":"Flexible Kubernetes Multitenancy with vCluster","description":null,"date":null,"conference":"DevBcn 2026","tags":["Platform Engineering","Kubernetes","vCluster"],"recordingUrl":null,"conferenceUrl":null,"slidesUrl":null,"workshopUrl":null,"type":"talk","status":"submitted","upcoming":false}]
