[
 {
   "title": "How to create and maintain good software documentation",
   "description": "A comprehensive approach to modern software documentation, focusing on simplicity, holistic coverage, automation, reusability, and portability in the rapid development environment.",
   "date": "2021-11",
   "conference": "Worldwide Software Architecture Summit 2021 (WSAS) - Geekle",
   "tags": [
     "Documentation",
     "Architecture", 
     "Best Practices"
   ],
   "recordingUrl": "https://youtu.be/-YmLFMDUzv0",
   "conferenceUrl": null,
   "slidesUrl": null,
   "abstract": "Let's define desired characteristics of software documentation to fit into modern, rapid pace of development. Documentation should be Simple to decrease maintenance effort and make sure all stakeholders can understand the core concepts. Holistic to account for different types of documentation consumers requiring different contexts. Automated to ensure maintenance over time with minimal impact on development teams. Reusable across software projects with a structured but flexible documentation model. Portable to generate and distribute documentation independently on any hosting medium."
 },
 {
   "title": "Kubernetes Certifications: How to Take Your Career to Next Level",
   "description": "A comprehensive guide to CNCF's Kubernetes certifications (CKA, CKAD, CKS), including learning processes, certification details, and practical tips for exam success.",
   "date": "2023-11",
   "conference": "DevOps Meetup",
   "tags": [
     "Kubernetes",
     "Certification",
     "Career Development"
   ],
   "recordingUrl": "https://youtu.be/xn1O6L3yqf0?t=2507",
   "conferenceUrl": null,
   "slidesUrl": null,
   "abstract": "Some say that Kubernetes is a fabric for cloud native applications, platform to build platforms or operating system of the cloud. Well, all of those statements are true, but most importantly, Kubernetes is everywhere and its popularity will only grow, as it fades to the background powering workloads on servers in public, private and hybrid clouds, on edge and even in space. Big part of DevOps movement is 'learning culture'. Companies expect more from new and seasoned employees, technologies come and go with neck breaking speed. One proven way of continuously learning is investing in yourself by learning and validating your knowledge with a certificate. CNCF created 3 Kubernetes certifications, one for administrators: CKA, for developers: CKAD and security specialists: CKS. During this talk we will look into learning process, certification details and I will share with you tips and tricks on how to pass the exams."
 },
 {
   "title": "How to Learn Cloud Native Technologies Using AI",
   "description": "A practical guide to leveraging AI tools like Flowise for mastering Kubernetes and other CNCF technologies more efficiently.",
   "date": "2024-02",
   "conference": "Localhost Conference 2024",
   "tags": [
     "Artificial Intelligence",
     "Cloud Native",
     "Education"
   ],
   "recordingUrl": "https://youtu.be/_L48jgOHKN4?t=10885",
   "conferenceUrl": "https://sessionize.com/localhost-conference-2024/",
   "slidesUrl": null,
   "abstract": "Are you struggling to learn Kubernetes or other CNCF technologies? You're not alone! Kubernetes can be complex, but with the power of AI, mastering it becomes much easier. In this video, we'll show you how AI tools, like Flowise, can help you understand Kubernetes faster and more effectively."
 },
 {
   "title": "How to Build Cloud-Native Platforms with Kubernetes",
   "description": "Platform Engineering and SRE focus on empowering developers and organizations by creating and maintaining internal software products known as platforms. This talk explores what platforms are, why they are important, and uncovers best practices for well-architected platforms.",
   "date": "2024-02",
   "conference": "Conf42 Platform Engineering 2024",
   "tags": [
     "Platform Engineering",
     "Kubernetes",
     "Cloud Native"
   ],
   "recordingUrl": "https://www.youtube.com/watch?v=HQNeAZUXzbk",
   "conferenceUrl": "https://www.conf42.com/Platform_Engineering_2024_Piotr_Zaniewski_cloudnative_kubernetes_platforms",
   "slidesUrl": null,
   "abstract": "Platform Engineering and SRE focus on empowering developers and organizations by creating and maintaining internal software products known as platforms. In this blog, we will explore what platforms are, why they are important, and uncover best practices for well-architected platforms."
 },
 {
   "title": "The Architecture of Developer Platforms",
   "description": "A deep dive into infrastructure-focused developer platforms, covering best practices, success metrics, common pitfalls, and emerging architectural patterns.",
   "date": "2024-03",
   "conference": "Worldwide Software Architecture Summit 2024 – Career Track",
   "tags": [
     "Platform Engineering",
     "Architecture",
     "Best Practices"
   ],
   "recordingUrl": "https://youtu.be/D2EjyyA5gZQ?t=15411",
   "conferenceUrl": null,
   "slidesUrl": null,
   "abstract": "Internal Developer Platforms become more and more popular. There are many kinds of platforms; software focused, security, cost management and infrastructure. This talk focuses on best practices of architecting infrastructure focused developer platforms. The talk covers: what is an infrastructure focused developer platform, how to measure its success, how to avoid common design mistakes, what are emerging architectural patterns for designing those platforms, what tools can help in the design process, and how to use an internal platform. I work on a day-to-day basis with designing, testing and maintaining infrastructure platforms."
 },
 {
   "title": "Introduction to vCluster: Building Internal Developer Platforms",
   "description": "A hands-on workshop introducing vCluster for creating and managing virtual Kubernetes environments, focusing on practical implementation for platform engineering teams.",
   "date": "2024-03",
   "conference": "Kubernetes Community Days UK - London 2024",
   "tags": [
     "Platform Engineering",
     "Kubernetes",
     "Workshop"
   ],
   "recordingUrl": null,
   "conferenceUrl": "https://community.cncf.io/events/details/cncf-kcd-uk-presents-kubernetes-community-days-uk-london-2024/",
   "workshopUrl": "https://killercoda.com/decoder/course/vcluster/vcluster_introduction",
   "type": "workshop",
   "abstract": "The workshop introduces participants to vCluster, demonstrating how to create and manage virtual Kubernetes environments for multiple development teams. Attendees will learn to use vCluster effectively, starting with basic setups and progressing to more advanced configurations. Throughout the workshop, participants will take on the perspective of a platform engineering team, making decisions and implementing solutions to serve the needs of various development groups within an organization."
 }
]
